Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: Understand the view controller life cycle and its callbacks (for example, viewDidLoad, viewWillAppear and viewDidAppear)
ja: ビューコントローラのライフサイクルとそれのコールバックを理解する（例えば、viewDidLoad、viewWillAppearおよびviewDidAppear）

source: Understanding and implementing data persistence is a vital part of iOS app development.
ja: データ永続の理解と実装は、iOSアプリ開発の極めて重要な部分です。

source: Unfortunately, the Save button does not work yet.
ja: あいにく、Saveボタンはまだ機能しません。

source: Unfortunately, things no longer look quite right.
ja: あいにく、物事はもはや全く正しく見えません。

source: Unit testing is an essential part of writing code because it helps you catch errors that you might otherwise overlook.
ja: ユニットテストを行うことは、コードを記述することの極めて重要な部分です、なぜならそれは、あなたがうっかり見落とすエラーを捕らえる手助けをするからです。

source: Unless you are doing something highly unusual, you should use this class provided by Xcode to initialize your app and respond to app-level events.
ja: あなたが非常に変わった何事かをしない限り、あなたはXcodeによって提供されるこのクラスを使うことで、あなたのアプリを初期化してアプリ水準のイベントに応答すべきです。

source: Unwind segues provide a simple method for passing information back to an earlier view controller.
ja: 巻き戻しセグエは、単純なメソッドを以前のビューコントローラへさかのぼって渡します。

source: Update the template’s identifier to the cellIdentifier variable.
ja: 雛形の識別子をcellIdentifier変数へ更新してください。

source: Use UIStackView as a container
ja: UIStackViewをコンテナとして使う

source: Use switch statements instead of if statements when selecting between multiple options.
ja: 複数の選択肢から選ぶ場合、switch文をif文の代わりに使ってください。

source: Use Auto Layout to lay out a UI that automatically adapts to the user’s device size
ja: Auto Layout（自動レイアウト、自動配置）を使ってユーザーのデバイス（機器）の大きさに自動的に適応するUIを設置する

source: Use Core Data: Unselected.
ja: Core Dataの使用：非選択。

source: Use a switch statement to assign custom strings if the rating is 0 or 1.
ja: switch文を使ってカスタム文字列を割り当ててください、もしratingが0または1なら。

source: Use a navigation controller and show segues to navigate through hierarchical data.
ja: ナビゲーションコントローラと表示セグエを使って、階層データをあちこち閲覧してください。

source: Use modal segues to present tasks that the user must complete before continuing.
ja: モーダルセグエを使って、ユーザが続けていく前に完了しなければならない作業を提示してください。

source: Use property observers to observe and respond to changes in the property’s value.
ja: プロパティオブザーバを使って、プロパティの持つ値の変化を監視して応答してください。

source: Use segue identifiers to determine which segue is occurring
ja: セグエ識別子を使って、どのセグエが現れているか確かめる

source: Use stack views to create robust, flexible layouts
ja: スタックビューを使って、頑丈で、柔軟なレイアウトを作成する

source: Use the print() function to check that the ratingButtonTapped(_:) action is linked to the button as expected.
ja: print()関数を使ってratingButtonTapped(_:)アクションが期待されるようにボタンとリンクされるか確認してください。

source: Use the Fix-it to insert the required keyword.
ja: Fix-itを使ってrequiredキーワードを挿入してください。

source: Use the Object library to find a Horizontal Stack View object and drag it onto the table cell.
ja: Objectライブラリを使ってHorizontal Stack Viewオブジェクトを見つけて、それをテーブルセル上にドラッグしてください。

source: Use the Object library to find a Label object and drag it onto the table cell.
ja: オブジェクトライブラリを使ってLabelオブジェクトを探してそれをテーブルセル上にドラッグしてください。

source: Use the Object library to find an Image View object and drag it onto the table cell.
ja: オブジェクトライブラリを使ってImage Viewオブジェクトを探してそれをテーブルセル上へドラッグしてください。

source: Use the asset catalog to add image assets to a project
ja: アセットカタログ（資産目録）を使用して画像資産をプロジェクトに加える

source: Use the space below this comment to create private methods—methods with the private modifier before the func introducer.
ja: このコメントの下の空間を使ってプライベートメソッド — private修飾子をfunc導入子の前に持つメソッド、を作成してください。

source: Use the text field’s placeholder text to prompt the user to enter the name of a new meal.
ja: このテキスト欄のプレースホルダテキスト（仮に入れておくテキスト）を使って、新しい食事の名前を入力するようユーザに促してください。

source: Use this image from the Images/ folder of the downloadable file at the end of this lesson, or use your own image.
ja: この画像を、このレッスンの終わりでダウンロード可能なファイルのImages/フォルダから使ってください、またはあなた独自の画像を使ってください。

source: Use this method to perform any additional setup required by your view controller.
ja: このメソッドを使って、あなたのビューコントローラによって必要とされる追加的な準備を何であれ実行してください。

source: Use this method to trigger any operations that need to occur as soon as the view is presented onscreen, such as fetching data or showing an animation.
ja: このメソッドを使って、コンテンツビューが画面上に提示されるやいなや起こる必要がある何らかの演算を引き起こしてください、例えばデータを取ってきたりアニメーションを表示するなど。

source: Use this method to trigger any operations that need to occur before the content view is presented onscreen.
ja: このメソッドを使って、コンテンツビューが画面上に提示される前に起こる必要がある何らかの演算を引き起こしてください。

source: Use unwind segues to implement navigation back to an existing view controller.
ja: 巻き戻しセグエを使って、既存のビューコントローラに戻るナビゲーションを実装してください。

source: Users can choose a rating for a meal.
ja: ユーザは、ある食事の格付けを選ぶことができます。

source: Use an array to store and work with data
ja: 配列を使ったデータの保存と活用

source: Use gesture recognizers to generate events
ja: ジェスチャリコグナイザ（身振り認識）を使ってイベントを生成する

source: Use the NSCoding protocol to read and write data
ja: NSCodingプロトコルを使ってデータを読み書きする

source: Using a guard statement for requirements improves the readability of your code, compared to doing the same check with an if statement.
ja: 要件のためにguard文を使うことは、同じ検査をif文ですることと比較して、あなたのコードの読みやすさを改善します。

source: Using the UIApplicationMain attribute is equivalent to calling the UIApplicationMain function and passing your AppDelegate class’s name as the name of the delegate class.
ja: UIApplicationMain属性を使用することは、UIApplicationMain関数を呼び出してあなたのAppDelegateクラスの名前をデリゲートクラスの名前として渡すことに同等です。

source: Using the NSCoding approach, the Meal class is in charge of storing and loading each of its properties.
ja: NSCodingの手法を使って、Mealクラスはそれのプロパティの格納とロードの世話をします。

source: View and rearrange UI elements using the outline view
ja: UI要素をアウトラインビューを使って表示して位置を直す

source: View controllers coordinate the flow of information between the app’s data model, which encapsulates the app’s data, and the views that display that data, manage the life cycle of their content views, handle orientation changes when the device is rotated, define the navigation within your app, and implement the behavior to respond to user input.
ja: これらビューコントローラは、アプリのデータをカプセル化するアプリのデータモデルとそのデータを表示するビューとの間の情報の流れを調整して、それらのコンテンツビューのライフサイクルを管理して、機器が回転される時に方向変更を取り扱い、あなたのアプリ内部の見て行き方を定義して、そしてユーザ入力への応答の挙動を実装します。

source: View this set of incremental lessons as a guided introduction to building your first app—including the tools, major concepts, and best practices that will ease your path.
ja: この一連の徐々に進むレッスン（授業）を、あなたの初めてのアプリ作成のための指導付き入門書だと考えてください—それはあなたの道行きを楽にするツール、主要な概念、そして最良の慣行を含んでいます。

source: Views are arranged in a hierarchical structure called the view hierarchy.
ja: ビューは、ビュー階層と呼ばれる、ある階層構造の中に並べられます。

source: Views are instances of the UIView class or one of its subclasses.
ja: ビューはUIViewクラスまたはそれのサブクラスの１つのインスタンスです。

source: Views have a variety of useful built-in behaviors, including displaying themselves onscreen and reacting to user input.
ja: ビューは、それら自身を画面上で表示したりユーザ入力に反応したりを含む、いろいろの有用な組み込みの挙動を持ちます。

source: Views not only display themselves onscreen and react to user input, they can serve as containers for other views.
ja: ビューは、それ自身を画面上で表示してユーザの入力に反応するだけではありません、それは他のビューの容れ物としての役割をすることができます。

source: VoiceOver is a revolutionary screen reader for blind and low vision users.
ja: VoiceOverは、視覚障害および低視力ユーザのための革命的な画面読み上げ機構です。

source: VoiceOver reads your user interface to the user.
ja: VoiceOverは、あなたのユーザインターフェイスをユーザのために読み上げます。

source: VoiceOver, however, often requires a little attention.
ja: VoiceOverは、しかしながら、しばしば少しの注意が必要とされます。

source: Watch the Xcode toolbar as the build process completes.
ja: Xcoceツールバーがビルドプロセスが完了するのを見守ります。

source: Weak references help prevent reference cycles; however, to keep the object alive and in memory you need to make sure some other part of your app has a strong reference to the object.
ja: 弱い（weak）参照は参照循環を防ぐ助けとなります；しかしながら、オブジェクトを生存させてメモリに保つためにはあなたはあなたのアプリの何か他の部分がそのオブジェクトに対して強い参照を持つことを確かなものにする必要があります。

source: What a user types using that keyboard gets inserted into the text field.
ja: ユーザがキーボードを使ってタイプすることは、テキスト欄へと挿入されます。

source: What happens if a user tries to save a meal with no name?
ja: ユーザが食事を名前なしで保存しようとするとき何が起こるでしょう？

source: What happens when you click on the image view?
ja: あなたがイメージビューの上でクリックするとき何が起こるでしょう？

source: What’s Next?
ja: 次はなに？

source: When Xcode brings up the list of potential completions, scroll through the list until you find the one you want and then press Return.
ja: Xcodeが見込みのある補完のリストを提出する場合、そのリストをあなたが望むものを見つけるまでずっとスクロールして、それからリターンキーを押してください。

source: When Xcode creates a new Swift file, it imports the Foundation framework by default, letting you work with Foundation data structures in your code.
ja: Xcodeが新しいSwiftファイルを作成する場合、それはFoundationフレームワークを初期状態でインポートし、あなたにFoundationデータ構造をあなたのコードで扱わせます。

source: When a ViewController instance is loaded, it sets itself as the delegate of its nameTextField property.
ja: ViewControllerインタンスがロードされる時、それはそれ自身をそれのnameTextFieldプロパティの委任先として設定します。

source: When a class is a subclass of another class, it gets all of its behavior (methods, properties, and other characteristics) from its superclass.
ja: あるクラスが別のクラスのサブクラスである時、それはそれのスーパークラスからその挙動の全て（メソッド、プロパティ、および他の特徴）を獲得します

source: When a user taps a star, that star and the stars preceding it are filled in.
ja: ユーザがある星をタップするとき、その星とそれの前にある星が塗りつぶされます。

source: When a user taps the image view, they should be able to choose a photo from a collection of photos, or take one of their own.
ja: ユーザがイメージビューをタップするとき、彼らが写真を写真コレクションから選ぶこと、または彼ら自身のものを取得できるべきです。

source: When a user wants to finish editing the text field, the text field needs to resign its first-responder status.
ja: ユーザがテキスト欄の編集を終えたい時は、テキスト欄はそれのファーストレスポンダ状態をやめる必要があります。

source: When a view controller is loaded from a storyboard, the system instantiates the view hierarchy and assigns the appropriate values to all the view controller’s outlets.
ja: あるビューコントローラがストーリーボードからロードされる時、システムはビュー階層をインスタンス化して適切な値をビューコントローラの持つアウトレット全てに割り当てます。

source: When in editing mode, the rating control extends over the delete button.
ja: 編集モードの場合、格付けコントロールは削除ボタンを超えて伸長します。

source: When it turns into a play arrow icon, click it.
ja: それが再生矢印アイコンになった時、それをクリックしてください。

source: When that event takes place, the system execute’s the action’s code.
ja: そのイベントが起こるときに、システムはそのアクションの持つコードを実行します。

source: When the app is running, the setupButtons() method is only called once, when the control is first loaded from the storyboard.
ja: アプリが動作している時、setupButtons()メソッドはただ一度だけ、コントロールが最初にストーリーボードからロードされる時に呼び出されます。

source: When the data is modified, the app saves it.
ja: データが修正される時は、アプリはそれを保存します。

source: When the interface is displayed on an iPhone SE, the text field should shrink.
ja: インターフェイスがiPhone SE上で表示される場合、テキスト欄は縮まなければなりません。

source: When the user runs your app with VoiceOver enabled, when they touch one of the buttons, VoiceOver reads the button’s label, followed by the word button.
ja: ユーザがあなたのアプリをVoiceOverを有効にして実行する場合、彼らがボタンの１つをタッチする時、VoiceOverはボタンのラベルを、単語buttonの後に続けて読み上げます。

source: When the user tap on a meal in the list scene, you’ll display that meal in the detail scene.
ja: ユーザがある食事をリストシーンにおいてタップする時、あなたはその食事を詳細シーンにおいて表示します。

source: When the user taps a row in the meal list, this segue is triggered.
ja: ユーザが食事リストの中のある列をタップする時、このセグエが引き起こされます。

source: When the user taps a text field, it automatically becomes the first responder.
ja: ユーザがあるテキスト欄をタップする時、それは自動的にファーストレスポンダになります。

source: When the user touches the button, whether or not it is selected, the system will show the highlighted button image.
ja: ユーザがボタンにタッチする場合、それが選択されるかどうかに関係なく、システムはボタン画像を強調して示すでしょう。

source: When the view loads, this code calls the helper method you just wrote to load the sample data.
ja: ビューがロードされる時、このコードはあなたがちょうど書いたヘルパーメソッドを呼び出して見本のデータをロードします。

source: When you access an implicitly unwrapped optional, the system assumes it has a valid value and automatically unwraps it for you.
ja: あなたが暗黙的にアンラップされるオプショナルにアクセスする時、システムはそれが有効な値を持つと決めてかかり、自動的にそれをあなたの代わりにアンラップします。

source: When you add a view to a stack view, the stack view automatically sets the view’s translatesAutoresizingMaskIntoConstraints property to false.
ja: あなたがあるビューをスタックビューに加える場合、そのスタックビューは自動的にビューの持つtranslatesAutoresizingMaskIntoConstraintsプロパティをfalseに設定します。

source: When you click the Delete button for a cell, the cell is removed from the list.
ja: あなたがあるセルに対してDeleteボタンをクリックする時、そのセルはリストから取り除かれます。

source: When you click the Done button on the keyboard, the keyboard is dismissed and the label text changes to display the text in the text field.
ja: あなたがDoneボタンをキーボード上でクリックする時、キーボードは片付けられてラベルテキストは変更されてそのテキストがテキスト欄で表示されます。

source: When you click the Set Default Label Text button, the label changes from what’s currently displayed in the label to Default Text (the value set by the action you defined earlier).
ja: あなたがSet Default Label Textボタンをクリックする時、ラベルは現在ラベルに表示されるものからDefault Text（あなたが以前に定義したアクションによって設定される値）へと変わります。

source: When you click the Set Default Label Text button, your setDefaultLabelText(_:) method is called, and the mealNameLabel object’s text value changes from Meal Name (the value set in your storyboard) to Default Text (the value set by the action).
ja: あなたがSet Default Label Textボタンをクリックするとき、あなたのsetDefaultLabelText(_:)メソッドが呼び出されます、そしてmealNameLabelオブジェクトの持つtext値はMeal Name（あなたのストーリーボードにおいて設定された値）からDefault Text（アクションによって設定された値）に変わります。

source: When you click the red square, you should see the “Button pressed” message in the console.
ja: あなたが赤い四角をクリックする時、あなたは「Button pressed」メッセージをコンソールにおいて見るはずです。

source: When you create a view controller subclass (like the ViewController class you’ve been working with), it inherits the methods defined in UIViewController and lets you add your own custom behavior for each method.
ja: あなたがあるビューコントローラのサブクラス（あなたが扱ったことのあるViewControllerクラスのようなもの）を作成する時には、それは、UIViewControllerで定義されるメソッドを継承し、そしてあなたにあなた独自のあつらえの挙動をそれぞれのメソッドに加えさせます。

source: When you programmatically instantiate a view, its translatesAutoresizingMaskIntoConstraints property defaults to true.
ja: あなたがプログラム的にビューをインスタンス化する場合、それのtranslatesAutoresizingMaskIntoConstraintsプロパティは初期状態でtrueになります。

source: When you ran your app in the iPhone 7 Simulator app, the view in this scene is what you saw on the device screen.
ja: あなたがあなたのアプリをiPhone 7 シミュレータアプリで実行した場合、このシーンの中のビューはあなたがデバイス画面上で見たとおりです。

source: When you select a meal, you can click Cancel to return to the meal list without saving any changes to the meal.
ja: あなたが食事を選択する場合、あなたはCancelをクリックすることで、その食事に対して何ら変更を保存することなしに食事リストに戻ることができます。

source: When you select the show segue, Interface Builder sets up the show segue and alters the meal detail scene’s appearance in the canvas—it is presented with a navigation bar in Interface Builder.
ja: あなたが表示セグエを選択する場合、Interface Builderは表示セグエを準備してキャンバスにおいて食事詳細シーンの外観を改めます — それはInterface Builderにおいてナビゲータバーとともに表されます。

source: When you set this property to true, the system adds the constraint to the correct view, and activates it.
ja: あなたがこのプロパティをtrueに設定する場合、システムは制約を正しいビューに加えます、そしてそれを活性化します。

source: When you work with accepting user input from a text field, you need some help from a text field delegate.
ja: あなたがテキスト欄からのユーザ入力の受け取りを扱うとき、あなたは、テキスト欄の委任先からの助けを必要とします。

source: When you’re finished, your app will look something like this:
ja: あなたが作業し終わった時、あなたのアプリはこのようなものに見えるでしょう：

source: Whenever a segue gets triggered, it provides a place for you to add your own code that gets executed.
ja: あるセグエが引き起こされる時はいつでも、それはあなたのために場所を提供して、あなた自身のコードを加えさせ、それが実行されるようになります。

source: Whenever the app launches, it loads the existing data.
ja: アプリが起動するたびごとに、それは既存のデータをロードします。

source: Where control enters a program or piece of code.
ja: あるプログラムまたはコード断片に制御が進む入り口のところ。

source: Where to Go from Here
ja: これからどうする

source: While changing the meal’s name to “Default Text” isn’t particularly useful, it does illustrate an important point.
ja: 食事の名前を「Default Text」へ変更することは特に役に立つことではないけれども、それはある重要な点を例証します。

source: While designing the app, Interface Builder programatically instantiates the view when you add it to the canvas.
ja: アプリ設計の間、Interface Builderはプログラム的にビューを、あなたがそれをキャンバスに加える時にインスタンス化します。

source: While newer APIs have largely replaced selectors with blocks, many methods—like performSelector(_:) and addTarget(_:action:forControlEvents:)—still take selectors as arguments.
ja: 新しいAPIが大部分はセレクタをブロックで置き換える一方で、多くのメソッドは — performSelector(_:)およびaddTarget(_:action:forControlEvents:)などは — 依然としてセレクタを引数として取ります。

source: While pressing the Shift key on your keyboard, select the text field, label, and button.
ja: あなたのキーボードのシフトキーを押したままで、テキスト欄、ラベル、およびボタンを選択してください。

source: While regular segues create a new instance of the destination view controller, unwind segues let you return to view controllers that already exist.
ja: いつものセグエは行先ビューコントローラの新しいインスタンスを作成する一方、巻き戻しセグエはあなたをすでに存在するビューコントローラに帰らせます。

source: While you’re editing the text field’s attributes, you can also edit the attributes of the system keyboard that’s displayed when a user selects the text field.
ja: あなたがテキスト欄の属性を編集しているときに、あなたはまた、ユーザがそのテキスト欄を選択すると表示されるシステムキーボードの属性を編集することができます。

source: Why’s that?
ja: これはなぜ？

source: With data displaying as expected, it’s time to provide a way to navigate from the initial meal list scene to the meal detail scene.
ja: データが期待するように表示されているので、最初の食事リストシーンから食事詳細シーンに進んでいく方法を提供する時です。

source: With iOS built-in accessibility features, you can deliver an outstanding mobile experience to every customer, including those with special needs.
ja: iOSの組み込みのアクセシビリティ機能で、あなたは傑出したモバイル体験をすべての顧客に送り届けることができます、それらは特別な必要性を持つものを含みます。

source: With the cell configured, you can design its custom user interface directly in the storyboard.
ja: セルが構成されたので、あなたはそれのカスタムユーザインターフェイスを直接にあなたのストーリーボード上で設計できます。

source: With the default placeholder image added to your project, set the image view to display it.
ja: あなたのプロジェクトに加えた初期プレースホルダ画像をつかって、イメージビューがそれを表示するように設定します。

source: With the encoding method written, implement the initializer to decode the encoded data.
ja: 符号化メソッドが書かれたので、符号化されたデータを復号化するイニシャライザを実装します。

source: With the folder selected, in the bottom left corner, click the plus (+) button and choose New Image Set from the pop-up menu.
ja: そのフォルダが選択された状態で、１番下左隅で、プラス（+）ボタンをクリックしてNew Image Set（新規画像セット）をポップアップメニューから選んでください。

source: With the following:
ja: 以下のもので：

source: With the horizontal stack view selected, open the Identity inspector .
ja: 水平スタックビューが選択された状態で、Identityインスペクタ を開いてください。

source: With the image view selected, open the Attributes inspector in the Utility area.
ja: イメージビューが選択された状態で、Attributesインスペクタ をUtility区画で開いてください。

source: With the image view selected, open the Attributes inspector in the utility area.
ja: そのイメージビューが選択された状態で、Attributesインスペクタ をユーティリティ区画で開いてください。

source: With the image view selected, open the Attributes inspector .
ja: イメージビューが選択された状態で、Attributes（属性）インスペクタ を開きます。

source: With the image view selected, open the Size inspector in the utility area.
ja: イメージビューが選択された状態で、Sizeインスペクタ をユーティリティ区画で開きます。

source: With the stack view selected, open the Size inspector in the utility area.
ja: スタックビューが選択された状態で、Sizeインスペクタ をユーティリティ区画で開いてください。

source: With the table view cell selected, open the Attributes inspector in the utility area.
ja: テーブルビューセルが選択された状態で、Attributesインスペクタ をユーティリティ区画で開いてください。

source: With the table view selected, open the Size inspector in the utility area.
ja: テーブルビューが選択された状態で、Sizeインスペクタ をユーティリティ区画で開いてください。

source: With the text field selected, open the Attributes inspector in the utility area.
ja: テキスト欄が選択された状態で、Attributesインスペクタ をユーティリティ区画で開いてください。

source: With the view controller selected, choose Editor > Embed In > Navigation Controller.
ja: ビューコントローラが選択された状態で、Editor > Embed In > Navigation Controllerを選んでください。

source: With the view controller selected, open the Identity inspector .
ja: ビューコントローラが選択された状態で、同一性インスペクタ を開いてください。

source: With the view selected, open the Attributes inspector .
ja: このビューが選択された状態で、Attributesインスペクタ を開いてください。

source: With the view selected, open the Identity inspector .
ja: ビューが選択された状態で、同一性インスペクタ を開いてください。

source: With these methods implemented, you need to add code to save and load the list of meals whenever a user adds, removes, or edits a meal.
ja: これらのメソッドが実装されたので、あなたは、ユーザが食事を追加、編集、削除するたびに、食事のリストを保存およびロードするコードを加える必要があります。

source: Within that hierarchy, views enclosed within a view are called subviews, and the parent view that encloses a view is called its superview.
ja: この階層内で、あるビューの内部に納められるビューはサブビューと呼ばれます、そしてビューを納めている親ビューはスーパービューと呼ばれます。

source: Work with @IBInspectable and @IBDesignable to display and control a custom view in Interface Builder
ja: @IBInspectableと@IBDesignableで作業して、カスタムビューをInterface Builderにおいて表示する

source: Work with View Controllers
ja: ビューコントローラを扱う

source: Working with Table Views
ja: テーブルビューを扱う

source: Worse yet, if you select the rating control, its bounding box turns red, indicating that there’s a problem with the control’s layout.
ja: まだ悪いことに、あなたが格付けコントロールを選択するならば、それの境界ボックスは赤になり、コントロールのレイアウトで問題があることを指し示しています。

source: Wrapping Up
ja: まとめ

source: Write failable initializers for a custom class
ja: 失敗できるイニシャライザをカスタムクラスに対して書く

source: XIB files are an older way of designing the views managed by a view controller.
ja: これらXIBファイルは、ひとつのビューコントローラによって管理される複数ビューを設計する古い方法です。

source: Xcode adds a new navigation controller to your storyboard, sets the storyboard entry point to it, and assigns the meal list scene as its root view controller.
ja: Xcodeは、新しいナビゲーションコントローラをあなたのストーリーボードに加えて、ストーリーボードエントリポイントをそれに設定します、そして食事リストシーンをそれのルートビューコントローラとして任命します。

source: Xcode adds the necessary code to MealViewController.swift to set up the action.
ja: Xcodeは、不可欠なコードをMealViewController.swiftに加えて、このアクションを準備します。

source: Xcode adds the necessary code to ViewController.swift to set up the action method.
ja: Xcodeは、必要なコードをViewController.swiftに加えることでアクションメソッドを設定します。

source: Xcode adds the necessary code to ViewController.swift to set up the action.
ja: Xcodeは、不可欠なコードをViewController.swiftに加えることでアクションを確立します。

source: Xcode adds the necessary code to ViewController.swift to store a reference to the image view and configures the storyboard to set up that connection.
ja: Xcodeは、不可欠なコードをViewController.swiftに加えることでイメージビューへの参照を保管します、そしてストーリーボードを修正することでこの接続を確立します。

source: Xcode adds the necessary code to ViewController.swift to store a reference to the text field and configures the storyboard to set up that connection.
ja: Xcodeは、必要なコードをViewController.swiftに加えることでテキスト欄への参照を保管します、そしてストーリーボードを修正することでこの接続を確立します。

source: Xcode already created one such class that you looked at earlier, ViewController.swift, and connected it to the scene you’re working on in your storyboard right now.
ja: Xcodeは、すでに１つそのようなクラスを作成しました、それはあなたが前に見たViewController.swiftです、そしてちょうどそれをあなたのストーリーボードで扱っているシーンに接続しました。

source: Xcode also contains the iOS SDK, which extends Xcode to include the tools, compilers, and frameworks you need specifically for iOS development.
ja: XcodeはiOS SDKも含みます、それはXcodeを拡張してあなたが特にiOS開発に必要とするツール、コンパイラ、そしてフレームワークを含めます。

source: Xcode analyzes your existing layout to figure out that the items should stack vertically, not horizontally.
ja: Xcodeは、あなたの既存のレイアウトを解析して、それらの項目が、水平にではなしに、垂直に積み重ねられるべき状態を解決します。

source: Xcode creates MealTableViewController.swift, a source code file that defines your custom table view controller subclass.
ja: XcodeはMealTableViewController.swift、あなたのカスタムテーブルビューコントローラサブクラスを定義するファイル、を作成します、

source: Xcode creates a file called Meal.swift.
ja: Xcodeは、Meal.swiftと呼ばれるファイルを作成します。

source: Xcode creates a file that defines the MealTableViewCell class: MealTableViewCell.swift.
ja: Xcodeは、MealTableViewCellクラスを定義するファイル：MealTableViewCell.swiftを作成します。

source: Xcode creates a file that defines the RatingControl class: RatingControl.swift.
ja: Xcodeは、RatingControlクラスを定義するファイル：RatingControl.swiftを作成します。

source: Xcode displays messages about the build process in the activity viewer, which is in the middle of the toolbar.
ja: Xcodeは、メッセージをビルドプロセスについてアクティビティビューア（状況表示窓）の中で表示します、それはツールバーの中央にあります。
